Revit 2027 API
BuiltInFailures.CurveByPointFailures.UnableToGenerateCurve Property
 Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToGenerateCurve { get; }
Public Shared ReadOnly Property UnableToGenerateCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToGenerateCurve {
	FailureDefinitionId^ get ();
}
static member UnableToGenerateCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveByPointFailures Class
Autodesk.Revit.DB Namespace